# Curve Element Line Style Property

Source: https://www.revitapidocs.com/2026/691e64a2-e5ea-b619-4362-1a2c17e23b2f.htm

---

| Curve Element Line Style Property |
| --- |

The line style of this curve element.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Element LineStyle { get; set; }
```

```
Public Property LineStyle As Element
	Get
	Set
```

```
public:
property Element^ LineStyle {
	Element^ get ();
	void set (Element^ value);
}
```

```
member LineStyle : Element with get, set
```

#### Property Value

Element Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |
| InvalidOperationException | Thrown when regeneration failed. \-\- or \-\- Thrown when fail to get line style. |

Remarks The return of this property will be a \[!:Autodesk::Revit::DB::GraphicsStyle] element.
These graphics styles should be associated to subcategories of the BuiltInCategory OST\_Lines. See Also

#### Reference

CurveElement Class Autodesk.Revit.DB Namespace